%其中梅花林通道，按照梅花林大小分割成1.2m*1.2m的大小，搭建地图为蓝方地图，之后作为新分支上传到github,原点为r1启动区的中心
function [field_elements, field_rect] = create_field(origin)

% 绘制斜坡
ramp2 = draw_ramp([origin(1)+0.75,origin(2)+9.3+1.5/2,0], [1.5,1.5],0.4, 'y+', [0.498,0.498,0.498], 0.7);

%绘制平面
%R1启动区
draw_plane([origin(1)+0.5,origin(2)+0.5,0], [0,0,1], [1,1], [0,0,1], 1,[0,0,1])
%R2启动区
draw_plane([origin(1)+0.4+4.2,origin(2)+0.4,0], [0,0,1], [0.8,0.8],[0,0,1], 1,[0,0,1])
%重试区
draw_plane([origin(1)+0.5,origin(2)+0.5+11,0.45], [0,0,1], [1,1],[0,0,1], 1,[0,0,1])
%通道
%for i = 0:4
%    draw_plane([origin(1)+0.6,origin(2)+0.6+2+i*1.2,0], [0,0,1], [1.2,1.2],[0.5, 0.8, 1.0],0.2,[0.5, 0.8, 1.0])
%end
%for i = 0:4
%    draw_plane([origin(1)+0.6+4.8,origin(2)+0.6+2+i*1.2,0], [0,0,1], [1.2,1.2],[0.5, 0.8, 1.0],0.2,[0.5, 0.8, 1.0])
%end
%for i = 1:3
%    draw_plane([origin(1)+0.6+1.2*i,origin(2)+0.6+2,0], [0,0,1], [1.2,1.2],[0.5, 0.8, 1.0],0.2,[0.5, 0.8, 1.0])
%end
%已用兵器区
draw_plane([origin(1)+3.5+1.5/2,origin(2)+9.5+0.3/2,0.45], [0,0,1], [0.3,1.5],[1.0, 1.0, 0.8], 1,[1.0, 1.0, 0.8])

%绘制六面体
%三区高台
draw_box([origin(1)+1.5+4.5/2,origin(2)+12-2.5/2,0.4/2], [4.5,2.5,0.4], [0.5,0.8,1.0], 0.8)
draw_box([origin(1)+1.5/2,origin(2)+10.8+1.2/2,0.4/2], [1.5,1.2,0.4], [0.5,0.8,1.0], 0.8)
%九宫格
draw_box([origin(1)+6,origin(2)+1.62/2+9.74,0.4+(0.54*3+0.4)/2], [0.32,1.62,0.54*3+0.4], [1,1,1], 0.8)
%长杆架 高度0.5
draw_box([origin(1)+0.8/2+2.2,origin(2)+0.3/2,0.5/2], [0.8,0.3,0.5], [1,0,0], 0.8)
%端头架
draw_box([origin(1)+6,origin(2)+1.2/2+0.35,0.5/2], [0.8,1.2,0.5], [1,0,0], 0.8)

%   center    - 1×3 向量，代表长方体的几何中心坐标 [x, y, z]  
%   sizeXYZ   - 1×3 向量，代表长方体在 x/y/z 三个方向上的尺寸 [宽度, 深度, 高度]  
%   colorRGB  - 1×3 向量，代表长方体的 RGB 颜色（例如 [1,0,0] 表示红色）  
%   alpha     - 标量，代表长方体的透明度（0=完全透明，1=完全不透明）  
% 输出参数说明：  
%   h         - 返回 patch 对象的句柄，可用于后续修改该长方体的属性  